src/XMLtemplates/104-02_1G_AirPrice_Rq.xml

<!--Release 8.1-->
<!--Version Dated as of 15/Apr/2015 11:24:06-->
<!--Air Pricing For Galileo(1G) with LFS CheckFlightDetails Request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <air:AirPriceReq AuthorizedBy="user" CheckFlightDetails="true" CheckOBFees="true" TargetBranch="{{TargetBranch}}" TraceId="{{requestId}}"
                         xmlns:air="http://www.travelport.com/schema/air_v36_0">
            <com:BillingPointOfSaleInfo OriginApplication="UAPI" xmlns:com="http://www.travelport.com/schema/common_v36_0"/>
            <air:AirItinerary>
                {{#trips}}
                <air:AirSegment ArrivalTime="{{arrival}}"
                                DepartureTime="{{departure}}"
                                Carrier="{{airline}}"
                                ClassOfService="{{bookingClass}}"
                                CabinClass="{{serviceClass}}"
                                Origin="{{from}}"
                                Destination="{{to}}"
                                ETicketability="Yes"
                                Equipment="{{plane}}"
                                FlightNumber="{{flightNumber}}"
                                LinkAvailability="true"
                                PolledAvailabilityOption="Polled avail exists"
                                ProviderCode="1G"
                                Key="{{@index}}"
                                Group="0">
                </air:AirSegment>
                {{/trips}}
            </air:AirItinerary>
            {{#passengers}}
            <com:SearchPassenger Key="P_{{@index}}" Code="{{ageCategory}}"{{#if child}} Age="9"{{/if}} xmlns:com="http://www.travelport.com/schema/common_v36_0"/>
            {{/passengers}}
            <air:AirPricingCommand>
                {{#trips}}
                <air:AirSegmentPricingModifiers AirSegmentRef="{{@index}}" FareBasisCode="{{fareBasis}}"/>
                {{/trips}}
            </air:AirPricingCommand>
        </air:AirPriceReq>
    </soap:Body>
</soap:Envelope>